// prettier-ignore
export const gameRanks: { [key: string]: string[] } = {
  'Apex Legends': ['ブロンズ', 'シルバー', 'ゴールド', 'プラチナ', 'ダイヤモンド', 'マスター', 'プレデター'],
  'Battlefield 2042': ['初心者', '中級者', '上級者'],
  'Call of Duty: Modern Warfare II': ['ブロンズ', 'シルバー', 'ゴールド', 'プラチナ', 'ダイヤモンド', 'マスター', 'グランドマスター'],
  'Call of Duty: Warzone': ['ブロンズ', 'シルバー', 'ゴールド', 'プラチナ', 'ダイヤモンド', 'マスター', 'グランドマスター'],
  'Counter-Strike 2': ['シルバー', 'ゴールドノヴァ', 'マスターガーディアン', 'レジェンダリーイーグル', 'スプレームマスター', 'グローバルエリート'],
  'Destiny 2': ['初心者', '中級者', '上級者'],
  'Escape from Tarkov': ['初心者', '中級者', '上級者'],
  'Halo Infinite': ['ブロンズ', 'シルバー', 'ゴールド', 'プラチナ', 'ダイヤモンド', 'オニックス'],
  'Overwatch 2': ['ブロンズ', 'シルバー', 'ゴールド', 'プラチナ', 'ダイヤモンド', 'マスター', 'グランドマスター', 'トップ500'],
  'Paladins': ['ブロンズ', 'シルバー', 'ゴールド', 'プラチナ', 'ダイヤモンド', 'マスター', 'グランドマスター'],
  'PUBG: Battlegrounds': ['ブロンズ', 'シルバー', 'ゴールド', 'プラチナ', 'ダイヤモンド', 'エース', 'コンカラー'],
  'Rainbow Six Siege': ['コッパー', 'ブロンズ', 'シルバー', 'ゴールド', 'プラチナ', 'ダイヤモンド', 'チャンピオン'],
  'VALORANT': ['アイアン', 'ブロンズ', 'シルバー', 'ゴールド', 'プラチナ', 'ダイヤモンド', 'イモータル', 'レイディアント'],
};
